use rand::rng;
use rand::seq::{IndexedRandom};

#[derive(Clone)]
pub struct AnimalNameGenerator {
    adjectives: Vec<&'static str>,
    animals: Vec<&'static str>,
}

impl AnimalNameGenerator {
    pub fn new() -> Self {
        AnimalNameGenerator {
            adjectives: vec![
                "быстрая", "медленная", "умная", "хитрая", "гордая", 
                "смелая", "тихая", "громкая", "пушистая", "грациозная",
                "ловкая", "сильная", "неуклюжая", "зоркая", "верная",
                "игривая", "горячая", "холодная", "солнечная", "лунная",
                "северная", "южная", "лесная", "горная", "речная",
                "морская", "степная", "пустынная", "ночная", "утренняя",
                "зимняя", "весенняя", "летняя", "осенняя", "радужная",
                "серебристая", "золотая", "бронзовая", "мраморная", "полосатая",
            ],
            animals: vec![
                "лань", "рысь", "лиса", "волчица", "пантера",
                "пума", "гепард", "антилопа", "зебра", "газель",
                "ласка", "куница", "соболь", "выдра", "норка",
                // "сурок", "суслик", "хомяк", "белка", "бурундук",
                // "ласточка", "синица", "сова", "ворона", "сорока",
                // "чайка", "альбатрос", "фламинго", "павлин", "журавль",
                // "черепаха", "ящерица", "саламандра", "хамелеон", "игуана",
                // "форель", "щука", "карп", "осетр", "дельфин",
                // "стрекоза", "бабочка", "божья коровка", "кузнечик", "светлячок",
            ],
        }
    }
    
    pub fn generate(&self) -> String {
        let mut rng = rng();
        let adjective = self.adjectives.choose(&mut rng).unwrap_or(&"быстрая");
        let animal = self.animals.choose(&mut rng).unwrap_or(&"лань");
        
        format!("{} {}", adjective, animal)
    }
}
